Ursadon/nRIP24/examples/stm32f103c8/NRF24/nrf24.c
#include "stm32f10x_spi.h"
#include "stm32f10x_gpio.h"
/*
 Copyright (C) 2011 J. Coliz <maniacbug@ymail.com>

 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU General Public License
 version 2 as published by the Free Software Foundation.
 */

#include "nRF24L01.h"
#include "RF24_config.h"
#include "nrf24.h"
#include "string.h"

/****************************************************************************/

// Передаёт и принимает 1 байт по SPI, возвращает полученное значение
uint8_t _SPItransfer(uint8_t data) {
	/* Wait for transmission to complete */
	while (!SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE))
		;
	SPI_I2S_SendData(SPI1, data);
	/* Wait for received data to complete */
	while (!SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE))
		;
	/* Wait for SPI to be ready */
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_BSY))
		;
	/* Return data from buffer */
	return SPI_I2S_ReceiveData(SPI1);
}

void delay (uint64_t ticks) {
	for (unsigned long long j = 0; j < ticks*72000; ++j) {
		__NOP();
	}
}

void delayMicroseconds (uint64_t ticks) {
	for (unsigned long j = 0; j < ticks*72; ++j) {
		__NOP();
	}
}
void csn(uint8_t mode)
{

		if (mode == HIGH) {
			GPIO_SetBits(GPIOA, GPIO_Pin_4);
		}
		else {
			GPIO_ResetBits(GPIOA, GPIO_Pin_4);
		}
}

/****************************************************************************/

void ce(uint8_t level)
{
	if (level == HIGH) {
		GPIO_SetBits(GPIOA, GPIO_Pin_3);
	}
	else {
		GPIO_ResetBits(GPIOA, GPIO_Pin_3);
	}
}

/****************************************************************************/

  void beginTransaction() {
    csn(LOW);
  }

/****************************************************************************/

  void endTransaction() {
    csn(HIGH);
  }

/****************************************************************************/

uint8_t read_register_buf(uint8_t reg, uint8_t* buf, uint8_t len)
{
  uint8_t status;

  beginTransaction();
  status = _SPItransfer( R_REGISTER | ( REGISTER_MASK & reg ) );
  while ( len-- ){
    *buf++ = _SPItransfer(0xff);
  }
  endTransaction();

  return status;
}

/****************************************************************************/

uint8_t read_register(uint8_t reg)
{
  uint8_t result;

  beginTransaction();
  _SPItransfer( R_REGISTER | ( REGISTER_MASK & reg ) );
  result = _SPItransfer(0xff);
  endTransaction();

  return result;
}

/****************************************************************************/

uint8_t write_register_buf(uint8_t reg, const uint8_t* buf, uint8_t len)
{
  uint8_t status;

  beginTransaction();
  status = _SPItransfer( W_REGISTER | ( REGISTER_MASK & reg ) );
  while ( len-- )
    _SPItransfer(*buf++);
  endTransaction();

  return status;
}

/****************************************************************************/

uint8_t write_register(uint8_t reg, uint8_t value)
{
  uint8_t status;

  beginTransaction();
  status = _SPItransfer( W_REGISTER | ( REGISTER_MASK & reg ) );
  _SPItransfer(value);
  endTransaction();
  return status;
}

/****************************************************************************/

uint8_t write_payload(const void* buf, uint8_t data_len, const uint8_t writeType)
{
  uint8_t status;
  const uint8_t* current = (const uint8_t*)(buf);

   data_len = rf24_min(data_len, payload_size);
   uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;


  beginTransaction();
  status = _SPItransfer( writeType );
  while ( data_len-- ) {
    _SPItransfer(*current++);
  }
  while ( blank_len-- ) {
    _SPItransfer(0);
  }
  endTransaction();

  return status;
}

/****************************************************************************/

uint8_t read_payload(void* buf, uint8_t data_len)
{
  uint8_t status;
  uint8_t* current = (uint8_t*)(buf);

  if(data_len > payload_size) data_len = payload_size;
  uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;

  beginTransaction();
  status = _SPItransfer( R_RX_PAYLOAD );
  while ( data_len-- ) {
    *current++ = _SPItransfer(0xFF);
  }
  while ( blank_len-- ) {
    _SPItransfer(0xff);
  }
  endTransaction();

  return status;
}

/****************************************************************************/

uint8_t radio_flush_rx(void)
{
  return spiTrans( FLUSH_RX );
}

/****************************************************************************/

uint8_t radio_flush_tx(void)
{
  return spiTrans( FLUSH_TX );
}

/****************************************************************************/

uint8_t spiTrans(uint8_t cmd){

  uint8_t status;

  beginTransaction();
  status = _SPItransfer( cmd );
  endTransaction();

  return status;
}

/****************************************************************************/

uint8_t get_status(void)
{
  return spiTrans(NOP);
}

/****************************************************************************/
//#if !defined (MINIMAL)
//void print_status(uint8_t status)
//{
//  printf_P(PSTR("STATUS\t\t = 0x%02x RX_DR=%x TX_DS=%x MAX_RT=%x RX_P_NO=%x TX_FULL=%x\r\n"),
//           status,
//           (status & _BV(RX_DR))?1:0,
//           (status & _BV(TX_DS))?1:0,
//           (status & _BV(MAX_RT))?1:0,
//           ((status >> RX_P_NO) & 0x07),
//           (status & _BV(TX_FULL))?1:0
//          );
//}
//
///****************************************************************************/
//
//void print_observe_tx(uint8_t value)
//{
//  printf_P(PSTR("OBSERVE_TX=%02x: POLS_CNT=%x ARC_CNT=%x\r\n"),
//           value,
//           (value >> PLOS_CNT) & 0x0F,
//           (value >> ARC_CNT) & 0x0F
//          );
//}
//
///****************************************************************************/
//
//void print_byte_register(const char* name, uint8_t reg, uint8_t qty)
//{
//  //char extra_tab = strlen_P(name) < 8 ? '\t' : 0;
//  //printf_P(PSTR(PRIPSTR"\t%c ="),name,extra_tab);
////  #if defined (RF24_LINUX)
////    printf("%s\t =", name);
////  #else
////    printf_P(PSTR(PRIPSTR"\t ="),name);
////  #endif
////  while (qty--)
////    printf_P(PSTR(" 0x%02x"),read_register(reg++));
////  printf_P(PSTR("\r\n"));
//}
//
///****************************************************************************/
//
//void print_address_register(const char* name, uint8_t reg, uint8_t qty)
//{
//
////  #if defined (RF24_LINUX)
////    printf("%s\t =",name);
////  #else
////    printf_P(PSTR(PRIPSTR"\t ="),name);
////  #endif
////  while (qty--)
////  {
////    uint8_t buffer[addr_width];
////    read_register(reg++,buffer,sizeof buffer);
////
////    printf_P(PSTR(" 0x"));
////    uint8_t* bufptr = buffer + sizeof buffer;
////    while( --bufptr >= buffer )
////      printf_P(PSTR("%02x"),*bufptr);
////  }
////
////  printf_P(PSTR("\r\n"));
//}
//
///****************************************************************************/

void setChannel(uint8_t channel)
{
  const uint8_t max_channel = 125;
  write_register(RF_CH,rf24_min(channel,max_channel));
}

uint8_t getChannel()
{
  return read_register(RF_CH);
}
/****************************************************************************/

void setPayloadSize(uint8_t size)
{
  payload_size = rf24_min(size,32);
}

