Ursadon/nRIP24/examples/stm32f103c8/NRF24/nrf24.c
}

/****************************************************************************/

//Added the original startWrite back in so users can still use interrupts, ack payloads, etc
//Allows the library to pass all tests
void startWrite( const void* buf, uint8_t len, const uint8_t multicast ){

  // Send the payload

  //write_payload( buf, len );
  write_payload( buf, len,multicast? W_TX_PAYLOAD_NO_ACK : W_TX_PAYLOAD ) ;
  ce(HIGH);
  #if defined(CORE_TEENSY) || !defined(ARDUINO) || defined (RF24_SPIDEV) || defined (RF24_DUE)
	delayMicroseconds(10);
  #endif
  ce(LOW);


}

/****************************************************************************/

uint8_t rxFifoFull(){
	return read_register(FIFO_STATUS) & _BV(RX_FULL);
}
/****************************************************************************/

uint8_t radio_txStandBy(){

    #if defined (FAILURE_HANDLING) || defined (RF24_LINUX)
		uint32_t timeout = millis();
	#endif
	while( ! (read_register(FIFO_STATUS) & _BV(TX_EMPTY)) ){
		if( get_status() & _BV(MAX_RT)){
			write_register(NRF_STATUS,_BV(MAX_RT) );
			ce(LOW);
			radio_flush_tx();    //Non blocking, flush the data
			return 0;
		}
		#if defined (FAILURE_HANDLING) || defined (RF24_LINUX)
			if( millis() - timeout > 95){
				errNotify();
				#if defined (FAILURE_HANDLING)
				return 0;
				#endif
			}
		#endif
	}

	ce(LOW);			   //Set STANDBY-I mode
	return 1;
}

/****************************************************************************/

//uint8_t txStandBy_timeout(uint32_t timeout, uint8_t startTx){
//
//    if(startTx){
//	  stopListening();
//	  ce(HIGH);
//	}
//	uint32_t start = millis();
//
//	while( ! (read_register(FIFO_STATUS) & _BV(TX_EMPTY)) ){
//		if( get_status() & _BV(MAX_RT)){
//			write_register(NRF_STATUS,_BV(MAX_RT) );
//				ce(LOW);										  //Set re-transmit
//				ce(HIGH);
//				if(millis() - start >= timeout){
//					ce(LOW); flush_tx(); return 0;
//				}
//		}
//		#if defined (FAILURE_HANDLING) || defined (RF24_LINUX)
//			if( millis() - start > (timeout+95)){
//				errNotify();
//				#if defined (FAILURE_HANDLING)
//				return 0;
//				#endif
//			}
//		#endif
//	}
//
//
//	ce(LOW);				   //Set STANDBY-I mode
//	return 1;
//
//}

/****************************************************************************/

void maskIRQ(uint8_t tx, uint8_t fail, uint8_t rx){

	uint8_t config = read_register(NRF_CONFIG);
	/* clear the interrupt flags */
	config &= ~(1 << MASK_MAX_RT | 1 << MASK_TX_DS | 1 << MASK_RX_DR);
	/* set the specified interrupt flags */
	config |= fail << MASK_MAX_RT | tx << MASK_TX_DS | rx << MASK_RX_DR;
	write_register(NRF_CONFIG, config);
}

/****************************************************************************/

uint8_t radio_getDynamicPayloadSize(void)
{
  uint8_t result = 0;

  #if defined (RF24_LINUX)
  spi_txbuff[0] = R_RX_PL_WID;
  spi_rxbuff[1] = 0xff;
  beginTransaction();
  _SPItransfernb( (char *) spi_txbuff, (char *) spi_rxbuff, 2);
  result = spi_rxbuff[1];
  endTransaction();
  #else
  beginTransaction();
  _SPItransfer( R_RX_PL_WID );
  result = _SPItransfer(0xff);
  endTransaction();
  #endif

  if(result > 32) { radio_flush_rx(); delay(2); return 0; }
  return result;
}

/****************************************************************************/

uint8_t radio_available(void)
{
   return radio_available_in_pipe(0xff);
}

/****************************************************************************/

uint8_t radio_available_in_pipe(uint8_t pipe_num)
{
  if (!( read_register(FIFO_STATUS) & _BV(RX_EMPTY) )){

    // If the caller wants the pipe number, include that
    if ( pipe_num != 0xff ){
	  uint8_t status = get_status();
      pipe_num = ( status >> RX_P_NO ) & 0x07;
  	}
  	return 1;
  }
  return 0;
}

/****************************************************************************/

void radio_read( void* buf, uint8_t len ){

  // Fetch the payload
  read_payload( buf, len );

  //Clear the two possible interrupt flags with one command
  write_register(NRF_STATUS,_BV(RX_DR) | _BV(MAX_RT) | _BV(TX_DS) );

}

/****************************************************************************/
void radio_openWritingPipe(const uint8_t address)
{
  // Note that AVR 8-bit uC's store this LSB first, and the NRF24L01(+)
  // expects it LSB first too, so we're good.
	uint8_t address64[5] = {address,0xf1,0xf0,0xa1,0xa0};
	write_register_buf(RX_ADDR_P0,address64, addr_width);
	write_register_buf(TX_ADDR, address64, addr_width);

  //const uint8_t max_payload_size = 32;
  //write_register(RX_PW_P0,rf24_min(payload_size,max_payload_size));
  write_register(RX_PW_P0,payload_size);
}

/****************************************************************************/
static const uint8_t child_pipe[] =
{
  RX_ADDR_P0, RX_ADDR_P1, RX_ADDR_P2, RX_ADDR_P3, RX_ADDR_P4, RX_ADDR_P5
};
static const uint8_t child_payload_size[] =
{
  RX_PW_P0, RX_PW_P1, RX_PW_P2, RX_PW_P3, RX_PW_P4, RX_PW_P5
};


/****************************************************************************/
void setAddressWidth(uint8_t a_width){

	if(a_width -= 2){
		write_register(SETUP_AW,a_width%4);
		addr_width = (a_width%4) + 2;
	}else{
        write_register(SETUP_AW,0);
        addr_width = 2;
    }

}

/****************************************************************************/

void radio_openReadingPipe(uint8_t child, const uint8_t address)
{
  // If this is pipe 0, cache the address.  This is needed because
  // openWritingPipe() will overwrite the pipe 0 address, so
  // startListening() will have to restore it.
	uint8_t address64[5] = {address,0xf1,0xf0,0xa1,0xa0};
	uint8_t address8[] = {address};

  if (child == 0){
    memcpy(pipe0_reading_address,address64,addr_width);
  }
  if (child <= 6)
  {
    // For pipes 2-5, only write the LSB
    if ( child < 2 ){
    	write_register_buf(child_pipe[child], address64, addr_width);
    }else{
    	write_register_buf(child_pipe[child], address8, 1);
	}
    write_register(child_payload_size[child],payload_size);

    // Note it would be more efficient to set all of the bits for all open
    // pipes at once.  However, I thought it would make the calling code
    // more simple to do it this way.
    write_register(EN_RXADDR,read_register(EN_RXADDR) | _BV(child_pipe_enable[child]));

